posts/2023-03-22-Functors-in-my-Emacs?!.org
#+TITLE: Functors in my Emacs?!
#+DATE: [2023-03-22 Wed 23:58]

* DONE Functors in /my/ Emacs?!                                 :ignore:published:
CLOSED: [2023-03-22 Wed 23:58]
:PROPERTIES:
:PUBDATE:  [2023-03-22 Wed 23:57]
:BLOG_FILENAME: 2023-03-22-Functors-in-my-Emacs?!
:END:
:LOGBOOK:
- State "DONE"       from              [2023-03-22 Wed 23:58]
:END:

This will be a series of posts on some really cool concepts coming
from the more theoretical side of computer science, but I feel like
the sophisticated Emacs crowd will appreciate it.

So, why?  While working on [[https://github.com/emacs-elsa/Elsa][Elsa]], the Emacs Lisp Static Analyzer, I
came to the point of finally implementing generic types, which the
Haskell crowd calls [[https://en.wikipedia.org/wiki/Parametric_polymorphism][parametric polymorphism]] to confuse the
plebs[fn:1dfc38151494f627:In all seriousness, I love Haskell and the
community is in general great.].  But most programmers came across it
in one way or another in TypeScript, Java, C#, C++ or even Python (go
famously lacks this feature until very recently when there has been
some proposals to add it).  The syntax usually looks something like:

#+begin_src java
List<E> add(int index, E element)
#+end_src

where =E= is some concrete but unknown type.  We call =E= a /type variable/.

But first, let's go back to the beginning and state the problem.
Elsa, other than being the /program/ which checks the types is also a
/type system/.  Emacs of course has types, such as numbers, strings or
lists, but anything more complex can not be expressed.  For example,
you can't say "a list of numbers", "a hash table mapping keywords to
some cl-struct" and so on.  The second issue is that these types are
only tracked at runtime.  This might be a bit late to catch errors and
in case of a type error your program will crash, just like the Spanish
inquisition, when you least expect it.

Elsa is a /static/ analyzer, meaning it will analyze your code without
actually running it.  So it's something like a compiler, checking the
types and making sure everything matches up and ensuring that once you
run the code, it will never crash on nil being passed where it
shouldn't or a number being stuffed into =append=.

The analysis works in two main steps:

1. Read the code and turn it into some internal representation.
2. Simulate the evaluation rules of Elisp traversing this internal
   representation keeping track of variables in scope, expression
   types and checking all the rules.

For this, we need some structures to represent this data.  I will
forgo the explanation of the CST (concrete syntax tree) representation
for now and focus on the types.

** Quick primer on type representation in Elsa

In Elsa we represent all types as EIEIO classes inheriting from
=elsa-type= top level class.  Primitive types, like integers, strings,
symbols are represented by classes =elsa-type-int=, =elsa-type-string=,
...  Then there are more complex types which are rather /type functions/
or /type constructors/, mapping simple types to more structured types.
An example is a "list of something".  For this, we have a type
=elsa-type-list= which takes another type as an argument.

To make a list type, we invoke the constructor =(elsa-type-list
:item-type (elsa-type-string))=.  This would be a list of strings.
Because this is kind of unwieldily, Elsa has a macro to make types:
=(elsa-make-type (list string))= would construct a list of strings.  To
express the types from now on, I will use the syntax accepted by
=elsa-make-type=.

There are built-in types for many common types found in Emacs, such as:

- =(cons int string)= is a cons pair of integers and strings, like =(1 . "foo")=
- =(function (int string) symbol)= is a function taking an int and a string and returning a symbol
- =(class elsa-type)= is an EIEIO class =elsa-type=
- =(struct trinary)= is a =cl-defstruct= named =trinary=
- =(or int marker)= is a composite type which is either integer or a
  string, but we don't really know which one, because user can supply
  either.  This is useful to annotate functions which can take more
  than one type as their argument, such as =goto-char=.
- =(const :key)= represents only the constant value =:key= and nothing
  else.
- more can be found in the Elsa manual or reading the code :grin:

Types naturally form a hierarchy.  On the top is the type =mixed= which
represents everything and on the bottom is type =empty= which has no
values whatsoever.  If you imagine types as /sets of values/ you would
be pretty close. One type /accepts/ another if the other type is a
subset of the accepting type. Some examples:

#+begin_src elisp
(elsa-type-accept mixed string) ;; t, mixed contains all the values
(elsa-type-accept string nil) ;; nil, string can not be nil
(elsa-type-accept symbol keyword) ;; t, every keyword is a symbol
(elsa-type-accept keyword symbol) ;; nil, some symbols are not keywords

;; t, or is a "union" of string and int, and all the strings are
;; included there
(elsa-type-accept (or string int) string)

;; nil, the other argument can be "foo" but that is not a number.
(elsa-type-accept int (or string int))
#+end_src

Notice in the last example that the second type could assume a value 4
which is an integer, so =int= /could/ accept =(or string int)=, but not
always.  This can actually be expressed by a [[https://github.com/emacs-elsa/trinary-logic][three-valued logic]] and it
is in fact what Elsa uses internally, but about that maybe some other
time.

