2023-03-22-Functors-in-my-Emacs?!.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-22 Wed 23:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Functors in my Emacs?!</title>
<meta name="author" content="Matúš Goljer" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="css/blog.css" />
</head>
<body>
<div id="preamble" class="status">

<div style="text-align: left; float: left;">
  <a href="./index.html">Home</a>
  <a href="https://github.com/Fuco1/">GitHub</a>
  <a href="https://www.patreon.com/user?u=3282358">Patreon</a>
</div>
<div style="text-align: right;">
  <a href="https://github.com/Fuco1/Fuco1.github.io/discussions">Discussions</a>
  <a href="https://fuco1.github.io/rss.xml">RSS</a>
  <a href="https://twitter.com/Fuco1337">Twitter</a>
</div>
<hr />
</div>
<div id="content" class="content">
<h1 class="title">Functors in my Emacs?!</h1>

<p>
This will be a series of posts on some really cool concepts coming
from the more theoretical side of computer science, but I feel like
the sophisticated Emacs crowd will appreciate it.
</p>

<p>
So, why?  While working on <a href="https://github.com/emacs-elsa/Elsa">Elsa</a>, the Emacs Lisp Static Analyzer, I
came to the point of finally implementing generic types, which the
Haskell crowd calls <a href="https://en.wikipedia.org/wiki/Parametric_polymorphism">parametric polymorphism</a> to confuse the
plebs<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.  But most programmers came across it
in one way or another in TypeScript, Java, C#, C++ or even Python (go
famously lacks this feature until very recently when there has been
some proposals to add it).  The syntax usually looks something like:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #8cc4ff;">List</span>&lt;<span style="color: #8cc4ff;">E</span>&gt; <span style="color: #fce94f;">add</span>(<span style="color: #8cc4ff;">int</span> <span style="color: #fcaf3e;">index</span>, <span style="color: #8cc4ff;">E</span> <span style="color: #fcaf3e;">element</span>)
</pre>
</div>

<p>
where <code>E</code> is some concrete but unknown type.  We call <code>E</code> a <i>type variable</i>.
</p>

<p>
But first, let's go back to the beginning and state the problem.
Elsa, other than being the <i>program</i> which checks the types is also a
<i>type system</i>.  Emacs of course has types, such as numbers, strings or
lists, but anything more complex can not be expressed.  For example,
you can't say "a list of numbers", "a hash table mapping keywords to
some cl-struct" and so on.  The second issue is that these types are
only tracked at runtime.  This might be a bit late to catch errors and
in case of a type error your program will crash, just like the Spanish
inquisition, when you least expect it.
</p>

<p>
Elsa is a <i>static</i> analyzer, meaning it will analyze your code without
actually running it.  So it's something like a compiler, checking the
types and making sure everything matches up and ensuring that once you
run the code, it will never crash on nil being passed where it
shouldn't or a number being stuffed into <code>append</code>.
</p>

<p>
The analysis works in two main steps:
</p>

<ol class="org-ol">
<li>Read the code and turn it into some internal representation.</li>
<li>Simulate the evaluation rules of Elisp traversing this internal
representation keeping track of variables in scope, expression
types and checking all the rules.</li>
</ol>

<p>
For this, we need some structures to represent this data.  I will
forgo the explanation of the CST (concrete syntax tree) representation
for now and focus on the types.
</p>

<div id="outline-container-org8e14430" class="outline-2">
<h2 id="org8e14430">Quick primer on type representation in Elsa</h2>
<div class="outline-text-2" id="text-org8e14430">
<p>
In Elsa we represent all types as EIEIO classes inheriting from
<code>elsa-type</code> top level class.  Primitive types, like integers, strings,
symbols are represented by classes <code>elsa-type-int</code>, <code>elsa-type-string</code>,
&#x2026;  Then there are more complex types which are rather <i>type functions</i>
or <i>type constructors</i>, mapping simple types to more structured types.
An example is a "list of something".  For this, we have a type
<code>elsa-type-list</code> which takes another type as an argument.
</p>

<p>
To make a list type, we invoke the constructor <code>(elsa-type-list
:item-type (elsa-type-string))</code>.  This would be a list of strings.
Because this is kind of unwieldily, Elsa has a macro to make types:
<code>(elsa-make-type (list string))</code> would construct a list of strings.  To
express the types from now on, I will use the syntax accepted by
<code>elsa-make-type</code>.
</p>

<p>
There are built-in types for many common types found in Emacs, such as:
</p>

<ul class="org-ul">
<li><code>(cons int string)</code> is a cons pair of integers and strings, like <code>(1 . "foo")</code></li>
<li><code>(function (int string) symbol)</code> is a function taking an int and a string and returning a symbol</li>
<li><code>(class elsa-type)</code> is an EIEIO class <code>elsa-type</code></li>
<li><code>(struct trinary)</code> is a <code>cl-defstruct</code> named <code>trinary</code></li>
<li><code>(or int marker)</code> is a composite type which is either integer or a
string, but we don't really know which one, because user can supply
either.  This is useful to annotate functions which can take more
than one type as their argument, such as <code>goto-char</code>.</li>
<li><code>(const :key)</code> represents only the constant value <code>:key</code> and nothing
else.</li>
<li>more can be found in the Elsa manual or reading the code :grin:</li>
</ul>

<p>
Types naturally form a hierarchy.  On the top is the type <code>mixed</code> which
represents everything and on the bottom is type <code>empty</code> which has no
values whatsoever.  If you imagine types as <i>sets of values</i> you would
be pretty close. One type <i>accepts</i> another if the other type is a
subset of the accepting type. Some examples:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span>elsa-type-accept mixed string<span style="color: #888a85;">)</span> <span style="color: #73d216;">;; </span><span style="color: #73d216;">t, mixed contains all the values</span>
<span style="color: #888a85;">(</span>elsa-type-accept string nil<span style="color: #888a85;">)</span> <span style="color: #73d216;">;; </span><span style="color: #73d216;">nil, string can not be nil</span>
<span style="color: #888a85;">(</span>elsa-type-accept symbol keyword<span style="color: #888a85;">)</span> <span style="color: #73d216;">;; </span><span style="color: #73d216;">t, every keyword is a symbol</span>
<span style="color: #888a85;">(</span>elsa-type-accept keyword symbol<span style="color: #888a85;">)</span> <span style="color: #73d216;">;; </span><span style="color: #73d216;">nil, some symbols are not keywords</span>

<span style="color: #73d216;">;; </span><span style="color: #73d216;">t, or is a "union" of string and int, and all the strings are</span>
<span style="color: #73d216;">;; </span><span style="color: #73d216;">included there</span>
<span style="color: #888a85;">(</span>elsa-type-accept <span style="color: #888a85;">(</span><span style="color: #b4fa70;">or</span> string int<span style="color: #888a85;">)</span> string<span style="color: #888a85;">)</span>

<span style="color: #73d216;">;; </span><span style="color: #73d216;">nil, the other argument can be "foo" but that is not a number.</span>
<span style="color: #888a85;">(</span>elsa-type-accept int <span style="color: #888a85;">(</span><span style="color: #b4fa70;">or</span> string int<span style="color: #888a85;">))</span>
</pre>
</div>

<p>
Notice in the last example that the second type could assume a value 4
which is an integer, so <code>int</code> <i>could</i> accept <code>(or string int)</code>, but not
always.  This can actually be expressed by a <a href="https://github.com/emacs-elsa/trinary-logic">three-valued logic</a> and it
is in fact what Elsa uses internally, but about that maybe some other
time.
</p>
</div>
</div>
