posts/2023-03-22-Functors-in-my-Emacs?!.org
** So what about the generic types?

Generic types are super useful and basically any analyzer of Elisp
would not work without them.  The simplest example is the function
=car=.  =car= doesn't care what cons you give it, it will always politely
give the value of the first cell back.  So as a first attempt we can
type it:

#+begin_src elisp
(car :: (function ((cons mixed mixed)) mixed))
#+end_src

Which means: it's a function taking a cons of two "anythings"
returning an "anything".  But that's not /really/ what car does, is it?
The =car= and =cdr= of a cons cell have concrete and very real types
during runtime, we just don't know what they are beforehand.  But this
idea of "concrete but undetermined" is exactly what generics express.

So a second /generic/ attempt to type this would be:

#+begin_src elisp
(car :: (function ((cons &a &b)) &a))
#+end_src

This says that whatever the type of the car cell is (here a type
variable =&a=) is what the =car= function will return.

Now, this in itself is useless, because in a real program nothing has
a "type =&a=".  During the analysis we need to derive what is the actual
type that =&a= represents.  Consider the following example:

#+begin_src elisp
(car (cons 1 "hello")) ;; => 1
#+end_src

Here, the cons has a type =(cons int string)= and so by "overlapping"
the types we can derive that =&a= is an =int= and =&b= is a =string= and the
return type of the entire =car= form then must be an =int=.  This process
is called /unification/, because we unify the two type signatures:

#+begin_src elisp
(function ((cons &a  &b    )) &a )
           (cons int string)
;; -------
(function ((cons int &b    )) int) ;; &a -> int
           (cons int string)
;; -------
(function ((cons int string)) int) ;; &a -> int, &b -> string
           (cons int string)
;; done
#+end_src

The types were unified and the /unifying substitution/ is =&a -> int, &b
-> string=.

