2023-03-22-Functors-in-my-Emacs?!.html

<div id="outline-container-orge045b7e" class="outline-2">
<h2 id="orge045b7e">So what about the generic types?</h2>
<div class="outline-text-2" id="text-orge045b7e">
<p>
Generic types are super useful and basically any analyzer of Elisp
would not work without them.  The simplest example is the function
<code>car</code>.  <code>car</code> doesn't care what cons you give it, it will always politely
give the value of the first cell back.  So as a first attempt we can
type it:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #fce94f;">car</span> <span style="color: #fcaf3e;">::</span> <span style="color: #888a85;">(</span><span style="color: #8cc4ff;">function</span> (<span style="color: #888a85;">(</span><span style="color: #8cc4ff;">cons</span> <span style="color: #8cc4ff;">mixed</span> <span style="color: #8cc4ff;">mixed</span><span style="color: #888a85;">)</span>) <span style="color: #8cc4ff;">mixed</span><span style="color: #888a85;">))</span>
</pre>
</div>

<p>
Which means: it's a function taking a cons of two "anythings"
returning an "anything".  But that's not <i>really</i> what car does, is it?
The <code>car</code> and <code>cdr</code> of a cons cell have concrete and very real types
during runtime, we just don't know what they are beforehand.  But this
idea of "concrete but undetermined" is exactly what generics express.
</p>

<p>
So a second <i>generic</i> attempt to type this would be:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #fce94f;">car</span> <span style="color: #fcaf3e;">::</span> <span style="color: #888a85;">(</span><span style="color: #8cc4ff;">function</span> (<span style="color: #888a85;">(</span><span style="color: #8cc4ff;">cons</span> <span style="color: #fcaf3e;">&amp;a</span> <span style="color: #fcaf3e;">&amp;b</span><span style="color: #888a85;">)</span>) <span style="color: #fcaf3e;">&amp;a</span><span style="color: #888a85;">))</span>
</pre>
</div>

<p>
This says that whatever the type of the car cell is (here a type
variable <code>&amp;a</code>) is what the <code>car</code> function will return.
</p>

<p>
Now, this in itself is useless, because in a real program nothing has
a "type <code>&amp;a</code>".  During the analysis we need to derive what is the actual
type that <code>&amp;a</code> represents.  Consider the following example:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span>car <span style="color: #888a85;">(</span>cons 1 <span style="color: #e9b96e;">"hello"</span><span style="color: #888a85;">))</span> <span style="color: #73d216;">;; </span><span style="color: #73d216;">=&gt; 1</span>
</pre>
</div>

<p>
Here, the cons has a type <code>(cons int string)</code> and so by "overlapping"
the types we can derive that <code>&amp;a</code> is an <code>int</code> and <code>&amp;b</code> is a <code>string</code> and the
return type of the entire <code>car</code> form then must be an <code>int</code>.  This process
is called <i>unification</i>, because we unify the two type signatures:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #b4fa70;">function</span> <span style="color: #888a85;">((</span>cons <span style="color: #8cc4ff;">&amp;a</span>  <span style="color: #8cc4ff;">&amp;b</span>    <span style="color: #888a85;">))</span> <span style="color: #8cc4ff;">&amp;a</span> <span style="color: #888a85;">)</span>
           <span style="color: #888a85;">(</span>cons int string<span style="color: #888a85;">)</span>
<span style="color: #73d216;">;; </span><span style="color: #73d216;">-------</span>
<span style="color: #888a85;">(</span><span style="color: #b4fa70;">function</span> <span style="color: #888a85;">((</span>cons int <span style="color: #8cc4ff;">&amp;b</span>    <span style="color: #888a85;">))</span> int<span style="color: #888a85;">)</span> <span style="color: #73d216;">;; </span><span style="color: #73d216;">&amp;a -&gt; int</span>
           <span style="color: #888a85;">(</span>cons int string<span style="color: #888a85;">)</span>
<span style="color: #73d216;">;; </span><span style="color: #73d216;">-------</span>
<span style="color: #888a85;">(</span><span style="color: #b4fa70;">function</span> <span style="color: #888a85;">((</span>cons int string<span style="color: #888a85;">))</span> int<span style="color: #888a85;">)</span> <span style="color: #73d216;">;; </span><span style="color: #73d216;">&amp;a -&gt; int, &amp;b -&gt; string</span>
           <span style="color: #888a85;">(</span>cons int string<span style="color: #888a85;">)</span>
<span style="color: #73d216;">;; </span><span style="color: #73d216;">done</span>
</pre>
</div>

<p>
The types were unified and the <i>unifying substitution</i> is <code>&amp;a -&gt; int, &amp;b
-&gt; string</code>.
</p>
</div>
</div>
