posts/2023-03-22-Functors-in-my-Emacs?!.org
** Introducing Functors

Now, trigger warning for mathematicians.  I will be very loose about
the terminology.  I don't think it matters here very much.

Functor is a fancy word for "structure" and a functor map a more
generic =mapcar=.  We can imagine a functor as embedding a function into
a structure.  If we have a function:

#+begin_src elisp
(1+ :: (function (int) int))
#+end_src

we can embed it (somehow) into a list structure to produce a function

#+begin_src elisp
(1+-on-a-list :: (function ((list int)) (list int)))
#+end_src

Notice how the argument and return type =int= became =(list int)=.  We
/embedded/ the function into a richer structure, here, a list.

If you think about it, that's exactly what =mapcar= does.  A
hypothetical syntax =(mapcar '1+)= without the second list argument is a
"function" which expects one more argument, a =(list int)= and it
outputs a =(list int)=.[fn:3174657231ea840:I put function in quotes,
because in Elisp no such thing exists.  You must always provide all
the arguments to a function.  But you can imagine a /partial/
application, when you only provide some arguments and the result is a
new function expecting the rest of the arguments to finally produce
the result.  This can be achieved with the built-in =apply-partially=
function.]

#+begin_src elisp
         (1+  :: (function (      int)        int))
((mapcar '1+) :: (function ((list int)) (list int)))
#+end_src

A functor map generalizes the lists's =mapcar= to arbitrary structures.
The defining characteristic of a functor map is that the input and
output structure is the same and only the "contents" are changed.
Using a =mapcar= on a list we get out a list with updated elements.

Let's try some examples of functors.

First, let's take a =cons=.  A =cons= is a structure with two "cells", the
car and the cdr.  To "map" over a cons is to apply a function over the
car and the cdr.  So an implementation of a functor map (or =fmap=)
might be:

#+begin_src elisp
;; (fmap fun (cons      a       b))
;; =>        (cons (fun a) (fun b))

(defun fmap (fun cons-cell)
  (cons (funcall fun (car cons-cell))
        (funcall fun (cdr cons-cell))))

(fmap '1+ (cons 1 2)) ;; => (cons 2 3)
(fmap 'number-to-string (cons 1 2)) ;; => (cons "1" "2")
#+end_src

Another example might be an optional value.  Let's define a structure
"optional" which is either a value or "nothing".  Nothing is distinct
from a =nil= which still is a valid Elisp value.  Nothing is an
abstraction outside of Elisp type system really meaning absence of
anything meaningful (say result of division by zero).

#+begin_src elisp
(defclass optional () () :abstract t)
(defclass has-value (optional) ((value :initarg :value)))
(defclass nothing (optional) ())

(has-value :value 7) ;; has value 7
(nothing)            ;; => has no value
#+end_src

We can write a "safe" division by zero using this class like so:

#+begin_src elisp
(defun division (a b)
  (if (= b 0)
      (nothing)
    (has-value (/ a b))))
#+end_src

How would we map over this =optional= structure?  It consists of
two... options: =nothing= or =has-value=.  We can treat them one by one:

1. Mapping over nothing must produce nothing because =fmap= must
   preserve the structure and there's no structure in "nothing" (well,
   philosophically, even nothing is a structure of some sort).
2. Mapping over a =has-value= must also produce a =has-value= but with the
   updated content.   So the implementation is:

#+begin_src elisp
;; (fmap fun nothing)
;; =>        nothing
;; (fmap fun (has-value :value      7))
;; =>        (has-value :value (fun 7))

(defun fmap (fun optional)
  (cond
   ((nothing-p optional)
    ;; nothing in, nothing out.
    (nothing))
   ((has-value-p optional)
    ;; get the value out of the optional, call the function and wrap
    ;; it back into a new has-value.
    (has-value :value (funcall fun (oref optional value))))))

(fmap '1+ (nothing))      ;; => (nothing)
(fmap '1+ (has-value 1))  ;; => (has-value 2)

(fmap 'number-to-string (division 1 0)) ;; => (nothing)
(fmap 'number-to-string (division 1 2)) ;; => (has-value "0.5")
#+end_src

The interesting thing about this example is that we can have a
structure composed of multiple substructures and we can treat them on
a case by case basis.

If we go back to the list embedding of the =1+= function producing a
=(list int)= to a =(list int)= function, the embeddings for the cons and
optional would look very similar:

#+begin_src elisp
;; fmap on cons
((fmap '1+) :: (function ((cons int int)) (cons int int)))
;; fmap on optional
((fmap 'number-to-string) ::
 (function ((class (optional int))) (class (optional string))))
#+end_src

To generalize this further, we can replace the concrete /type
constructors/ (such as =cons=) and /type parameters/ (such as =int= or
=string)= with type variables:

#+begin_src elisp
(fmap :: (function ((function (&a) &b) (&f &a)) (&f &b)))
#+end_src

This rather cryptic line says that a =fmap= takes a function from =&a= to
=&b= and a structure (functor) =&f= holding things of type =&a=, and it
produces the same structure =&f= holding things of type =&b=.

Functors on their own do not seem very useful.  We have =mapcar= or the
specialized =fmap= and then what?  The real power of these abstractions
come when we implement /other/ operations in terms of the generic ones.
So let's jump into that to close this one out.

Finally, I should not omit the fact that there are some actual
[[https://en.wikipedia.org/wiki/Functor#Definition][mathematical laws]] the =fmap= function *must* satisfy to be a functor.
This blog post article being dense as it is, I leave this to the
reader to expand upon.  It's not very important when implementing
real-world functors as you almost always "have to" do it the right
way.

