2023-03-22-Functors-in-my-Emacs?!.html

<div id="outline-container-org60aae82" class="outline-2">
<h2 id="org60aae82">Introducing Functors</h2>
<div class="outline-text-2" id="text-org60aae82">
<p>
Now, trigger warning for mathematicians.  I will be very loose about
the terminology.  I don't think it matters here very much.
</p>

<p>
Functor is a fancy word for "structure" and a functor map a more
generic <code>mapcar</code>.  We can imagine a functor as embedding a function into
a structure.  If we have a function:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #fce94f;">1+</span> <span style="color: #fcaf3e;">::</span> <span style="color: #888a85;">(</span><span style="color: #8cc4ff;">function</span> (<span style="color: #8cc4ff;">int</span>) <span style="color: #8cc4ff;">int</span><span style="color: #888a85;">))</span>
</pre>
</div>

<p>
we can embed it (somehow) into a list structure to produce a function
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #fce94f;">1+-on-a-list</span> <span style="color: #fcaf3e;">::</span> <span style="color: #888a85;">(</span><span style="color: #8cc4ff;">function</span> (<span style="color: #888a85;">(</span><span style="color: #8cc4ff;">list</span> <span style="color: #8cc4ff;">int</span><span style="color: #888a85;">)</span>) <span style="color: #888a85;">(</span><span style="color: #8cc4ff;">list</span> <span style="color: #8cc4ff;">int</span><span style="color: #888a85;">)))</span>
</pre>
</div>

<p>
Notice how the argument and return type <code>int</code> became <code>(list int)</code>.  We
<i>embedded</i> the function into a richer structure, here, a list.
</p>

<p>
If you think about it, that's exactly what <code>mapcar</code> does.  A
hypothetical syntax <code>(mapcar '1+)</code> without the second list argument is a
"function" which expects one more argument, a <code>(list int)</code> and it
outputs a <code>(list int)</code>.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-elisp">         <span style="color: #888a85;">(</span><span style="color: #fce94f;">1+</span>  <span style="color: #fcaf3e;">::</span> <span style="color: #888a85;">(</span><span style="color: #8cc4ff;">function</span> (      <span style="color: #8cc4ff;">int</span>)        <span style="color: #8cc4ff;">int</span><span style="color: #888a85;">))</span>
<span style="color: #888a85;">((</span>mapcar <span style="color: #e6a8df;">'1+</span><span style="color: #888a85;">)</span> <span style="color: #ad7fa8;">::</span> <span style="color: #888a85;">(</span><span style="color: #b4fa70;">function</span> <span style="color: #888a85;">((</span>list int<span style="color: #888a85;">))</span> <span style="color: #888a85;">(</span>list int<span style="color: #888a85;">)))</span>
</pre>
</div>

<p>
A functor map generalizes the lists's <code>mapcar</code> to arbitrary structures.
The defining characteristic of a functor map is that the input and
output structure is the same and only the "contents" are changed.
Using a <code>mapcar</code> on a list we get out a list with updated elements.
</p>

<p>
Let's try some examples of functors.
</p>

<p>
First, let's take a <code>cons</code>.  A <code>cons</code> is a structure with two "cells", the
car and the cdr.  To "map" over a cons is to apply a function over the
car and the cdr.  So an implementation of a functor map (or <code>fmap</code>)
might be:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #73d216;">;; </span><span style="color: #73d216;">(fmap fun (cons      a       b))</span>
<span style="color: #73d216;">;; </span><span style="color: #73d216;">=&gt;        (cons (fun a) (fun b))</span>

<span style="color: #888a85;">(</span><span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">fmap</span> <span style="color: #888a85;">(</span>fun cons-cell<span style="color: #888a85;">)</span>
  <span style="color: #888a85;">(</span>cons <span style="color: #888a85;">(</span>funcall fun <span style="color: #888a85;">(</span>car cons-cell<span style="color: #888a85;">))</span>
        <span style="color: #888a85;">(</span>funcall fun <span style="color: #888a85;">(</span>cdr cons-cell<span style="color: #888a85;">))))</span>

<span style="color: #888a85;">(</span>fmap <span style="color: #e6a8df;">'1+</span> <span style="color: #888a85;">(</span>cons 1 2<span style="color: #888a85;">))</span> <span style="color: #73d216;">;; </span><span style="color: #73d216;">=&gt; (cons 2 3)</span>
<span style="color: #888a85;">(</span>fmap <span style="color: #e6a8df;">'number-to-string</span> <span style="color: #888a85;">(</span>cons 1 2<span style="color: #888a85;">))</span> <span style="color: #73d216;">;; </span><span style="color: #73d216;">=&gt; (cons "1" "2")</span>
</pre>
</div>

<p>
Another example might be an optional value.  Let's define a structure
"optional" which is either a value or "nothing".  Nothing is distinct
from a <code>nil</code> which still is a valid Elisp value.  Nothing is an
abstraction outside of Elisp type system really meaning absence of
anything meaningful (say result of division by zero).
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #b4fa70;">defclass</span> <span style="color: #8cc4ff;">optional</span> <span style="color: #888a85;">()</span> <span style="color: #888a85;">()</span> <span style="color: #ad7fa8;">:abstract</span> t<span style="color: #888a85;">)</span>
<span style="color: #888a85;">(</span><span style="color: #b4fa70;">defclass</span> <span style="color: #8cc4ff;">has-value</span> <span style="color: #888a85;">(</span>optional<span style="color: #888a85;">)</span> <span style="color: #888a85;">((</span>value <span style="color: #ad7fa8;">:initarg</span> <span style="color: #ad7fa8;">:value</span><span style="color: #888a85;">)))</span>
<span style="color: #888a85;">(</span><span style="color: #b4fa70;">defclass</span> <span style="color: #8cc4ff;">nothing</span> <span style="color: #888a85;">(</span>optional<span style="color: #888a85;">)</span> <span style="color: #888a85;">())</span>

<span style="color: #888a85;">(</span>has-value <span style="color: #ad7fa8;">:value</span> 7<span style="color: #888a85;">)</span> <span style="color: #73d216;">;; </span><span style="color: #73d216;">has value 7</span>
<span style="color: #888a85;">(</span>nothing<span style="color: #888a85;">)</span>            <span style="color: #73d216;">;; </span><span style="color: #73d216;">=&gt; has no value</span>
</pre>
</div>

<p>
We can write a "safe" division by zero using this class like so:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">division</span> <span style="color: #888a85;">(</span>a b<span style="color: #888a85;">)</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">if</span> <span style="color: #888a85;">(</span>= b 0<span style="color: #888a85;">)</span>
      <span style="color: #888a85;">(</span>nothing<span style="color: #888a85;">)</span>
    <span style="color: #888a85;">(</span>has-value <span style="color: #888a85;">(</span>/ a b<span style="color: #888a85;">))))</span>
</pre>
</div>

<p>
How would we map over this <code>optional</code> structure?  It consists of
two&#x2026; options: <code>nothing</code> or <code>has-value</code>.  We can treat them one by one:
</p>

<ol class="org-ol">
<li>Mapping over nothing must produce nothing because <code>fmap</code> must
preserve the structure and there's no structure in "nothing" (well,
philosophically, even nothing is a structure of some sort).</li>
<li>Mapping over a <code>has-value</code> must also produce a <code>has-value</code> but with the
updated content.   So the implementation is:</li>
</ol>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #73d216;">;; </span><span style="color: #73d216;">(fmap fun nothing)</span>
<span style="color: #73d216;">;; </span><span style="color: #73d216;">=&gt;        nothing</span>
<span style="color: #73d216;">;; </span><span style="color: #73d216;">(fmap fun (has-value :value      7))</span>
<span style="color: #73d216;">;; </span><span style="color: #73d216;">=&gt;        (has-value :value (fun 7))</span>

<span style="color: #888a85;">(</span><span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">fmap</span> <span style="color: #888a85;">(</span>fun optional<span style="color: #888a85;">)</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">cond</span>
   <span style="color: #888a85;">((</span>nothing-p optional<span style="color: #888a85;">)</span>
    <span style="color: #73d216;">;; </span><span style="color: #73d216;">nothing in, nothing out.</span>
    <span style="color: #888a85;">(</span>nothing<span style="color: #888a85;">))</span>
   <span style="color: #888a85;">((</span>has-value-p optional<span style="color: #888a85;">)</span>
    <span style="color: #73d216;">;; </span><span style="color: #73d216;">get the value out of the optional, call the function and wrap</span>
    <span style="color: #73d216;">;; </span><span style="color: #73d216;">it back into a new has-value.</span>
    <span style="color: #888a85;">(</span>has-value <span style="color: #ad7fa8;">:value</span> <span style="color: #888a85;">(</span>funcall fun <span style="color: #888a85;">(</span><span style="color: #b4fa70;">oref</span> optional value<span style="color: #888a85;">))))))</span>

<span style="color: #888a85;">(</span>fmap <span style="color: #e6a8df;">'1+</span> <span style="color: #888a85;">(</span>nothing<span style="color: #888a85;">))</span>      <span style="color: #73d216;">;; </span><span style="color: #73d216;">=&gt; (nothing)</span>
<span style="color: #888a85;">(</span>fmap <span style="color: #e6a8df;">'1+</span> <span style="color: #888a85;">(</span>has-value 1<span style="color: #888a85;">))</span>  <span style="color: #73d216;">;; </span><span style="color: #73d216;">=&gt; (has-value 2)</span>

<span style="color: #888a85;">(</span>fmap <span style="color: #e6a8df;">'number-to-string</span> <span style="color: #888a85;">(</span>division 1 0<span style="color: #888a85;">))</span> <span style="color: #73d216;">;; </span><span style="color: #73d216;">=&gt; (nothing)</span>
<span style="color: #888a85;">(</span>fmap <span style="color: #e6a8df;">'number-to-string</span> <span style="color: #888a85;">(</span>division 1 2<span style="color: #888a85;">))</span> <span style="color: #73d216;">;; </span><span style="color: #73d216;">=&gt; (has-value "0.5")</span>
</pre>
</div>

<p>
The interesting thing about this example is that we can have a
structure composed of multiple substructures and we can treat them on
a case by case basis.
</p>

<p>
If we go back to the list embedding of the <code>1+</code> function producing a
<code>(list int)</code> to a <code>(list int)</code> function, the embeddings for the cons and
optional would look very similar:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #73d216;">;; </span><span style="color: #73d216;">fmap on cons</span>
<span style="color: #888a85;">((</span>fmap <span style="color: #e6a8df;">'1+</span><span style="color: #888a85;">)</span> <span style="color: #ad7fa8;">::</span> <span style="color: #888a85;">(</span><span style="color: #b4fa70;">function</span> <span style="color: #888a85;">((</span>cons int int<span style="color: #888a85;">))</span> <span style="color: #888a85;">(</span>cons int int<span style="color: #888a85;">)))</span>
<span style="color: #73d216;">;; </span><span style="color: #73d216;">fmap on optional</span>
<span style="color: #888a85;">((</span>fmap <span style="color: #e6a8df;">'number-to-string</span><span style="color: #888a85;">)</span> <span style="color: #ad7fa8;">::</span>
 <span style="color: #888a85;">(</span><span style="color: #b4fa70;">function</span> <span style="color: #888a85;">((</span>class <span style="color: #888a85;">(</span>optional int<span style="color: #888a85;">)))</span> <span style="color: #888a85;">(</span>class <span style="color: #888a85;">(</span>optional string<span style="color: #888a85;">))))</span>
</pre>
</div>

<p>
To generalize this further, we can replace the concrete <i>type
constructors</i> (such as <code>cons</code>) and <i>type parameters</i> (such as <code>int</code> or
<code>string)</code> with type variables:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #fce94f;">fmap</span> <span style="color: #fcaf3e;">::</span> <span style="color: #888a85;">(</span><span style="color: #8cc4ff;">function</span> (<span style="color: #888a85;">(</span><span style="color: #8cc4ff;">function</span> <span style="color: #888a85;">(</span><span style="color: #fcaf3e;">&amp;a</span><span style="color: #888a85;">)</span> <span style="color: #fcaf3e;">&amp;b</span><span style="color: #888a85;">)</span> <span style="color: #888a85;">(</span><span style="color: #fcaf3e;">&amp;f</span> <span style="color: #fcaf3e;">&amp;a</span><span style="color: #888a85;">)</span>) <span style="color: #888a85;">(</span><span style="color: #fcaf3e;">&amp;f</span> <span style="color: #fcaf3e;">&amp;b</span><span style="color: #888a85;">)))</span>
</pre>
</div>

<p>
This rather cryptic line says that a <code>fmap</code> takes a function from <code>&amp;a</code> to
<code>&amp;b</code> and a structure (functor) <code>&amp;f</code> holding things of type <code>&amp;a</code>, and it
produces the same structure <code>&amp;f</code> holding things of type <code>&amp;b</code>.
</p>

<p>
Functors on their own do not seem very useful.  We have <code>mapcar</code> or the
specialized <code>fmap</code> and then what?  The real power of these abstractions
come when we implement <i>other</i> operations in terms of the generic ones.
So let's jump into that to close this one out.
</p>

<p>
Finally, I should not omit the fact that there are some actual
<a href="https://en.wikipedia.org/wiki/Functor#Definition">mathematical laws</a> the <code>fmap</code> function <b>must</b> satisfy to be a functor.
This blog post article being dense as it is, I leave this to the
reader to expand upon.  It's not very important when implementing
real-world functors as you almost always "have to" do it the right
way.
</p>
</div>
</div>
